app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "tom"], ["password_hash", "$2a$10$F55qCBfASXTHtYRgme320u4o5N2UAgHKeoVDIr.V.GD7ci3XkdYuy"], ["created_at", "2016-03-17 22:17:07.297288"], ["updated_at", "2016-03-17 22:17:07.297288"]]